using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SuanMing
{
    public static class SuanMingClass
    {
        #region Liang
        static double[] YearWeight = //from 1924 to 1984
        {
            1.2, 0.9, 0.6, 0.7, 1.2, 0.5, 0.9, 0.8, 0.7, 0.8, 1.5, 0.9, 
            1.6, 0.8, 0.8, 1.9, 1.2, 0.6, 0.8, 0.7, 0.5, 1.5, 0.6, 1.6,
            1.5, 0.7, 0.9, 1.2, 1.0, 0.7, 1.5, 0.6, 0.5, 1.4, 1.4, 0.9,
            0.7, 0.7, 0.9, 1.2, 0.8, 0.7, 1.3, 0.5, 1.4, 0.5, 0.9, 1.7,
            0.5, 0.7, 1.2, 0.8, 0.8, 0.6, 1.9, 0.6, 0.8, 1.6, 1.0, 0.7
        }; // 0.6 or 0.7?

        static double[] MonthWeight =
        {
            0.6, 0.7, 1.8, 0.9, 0.5, 1.6, 0.9, 1.5, 1.8, 0.8, 0.9, 0.5
        };

        static double[] DayWeight =
        {
            0.5, 1.0, 0.8, 1.5, 1.6, 
            1.5, 0.8, 1.6, 0.8, 1.6, 
            0.9, 1.7, 0.8, 1.7, 1.0, 
            0.8, 0.9, 1.8, 0.5, 1.5, 
            1.0, 0.9, 0.8, 0.9, 1.5, 
            1.8, 0.7, 0.8, 1.6, 0.6
        };

        static double[] HourWeight = //starts from 0000
        {
            1.6, 0.6, 0.6, 0.7, 0.7, 1.0, 1.0, 0.9, 0.9, 1.6, 1.6, 1.0,
            1.0, 0.8, 0.8, 0.8, 0.8, 0.9, 0.9, 0.6, 0.6, 0.6, 0.6, 1.6
        };
        #endregion

        #region OriginalResult
        static string[] OriginalResult = 
        {
            "短命非业谓大凶，平生灾难事重重，凶祸频临限逆境，终世困苦事不成",
            "身寒骨冷苦伶仃，此命推来行乞人，劳劳碌碌无度日，中年打拱过平生",
            "此命推来骨轻轻，求谋做事事难成，妻儿兄弟应难许，别处他乡作散人",
            "此命推来福禄无，门庭困苦总难荣，六亲骨肉皆无靠，流到他乡作老人",
            "此命推来祖业微，门庭营度似希奇，六亲骨肉如水炭，一世勤劳自把持",
            "平生一路苦中求，独自营谋事不休，离祖出门宜早计，晚来衣禄自无忧",
            "一生做事少商量，难靠祖宗作主张，独马单枪空作去，早年晚岁总无长",
            "一生作事似飘蓬，祖宗产业在梦中，若不过房并改姓，也当移徒二三通",
            "初年运限未曾亨，纵有功名在后成，须过四旬方可上，移居改姓使为良",
            "劳劳碌碌苦中求，东走西奔何日休，若能终身勤与俭，老来稍可免忧愁",
            "忙忙碌碌苦中求，何日云开见日头，难得祖基家可立，中年衣食渐无忧",
            "初年运错事难谋，渐有财源如水流，到的中年衣食旺，那时名利一齐来",
            "早年做事事难成，百计徒劳枉费心，半世自如流水去，后来运到始得金",
            "此命福气果如何，僧道门中衣禄多，离祖出家方得妙，终朝拜佛念弥陀",
            "生平福量不周全，祖业根基觉少传，营事生涯宜守旧，时来衣食胜从前",
            "不须劳碌过平生，独自成家福不轻，早有福星常照命，任君行去百般成",
            "此命般般事不成，弟兄少力自孤成，虽然祖业须微有，来的明时去的暗",
            "一生骨肉最清高，早入学门姓名标，待看年将三十六，蓝衣脱去换红袍",
            "此命少年运不通，劳劳做事尽皆空，苦心竭力成家计，到得那时在梦中",
            "平生衣禄是绵长，件件心中自主张，前面风霜都受过，从来必定享安泰",
            "此命推来事不同，为人能干异凡庸，中年还有逍遥福，不比前年云未通",
            "得宽怀处且宽怀，何用双眉总不开，若使中年命运济，那时名利一齐来",
            "为人心性最聪明，做事轩昂近贵人，衣禄一生天数定，不须劳碌是丰亨",
            "来事由天莫苦求，须知福禄胜前途，当年财帛难如意，晚景欣然便不忧",
            "福中取贵格求真，明敏才华志自伸，福禄寿全家道吉，桂兰毓秀晚荣臻",
            "东西南北尽皆通，出姓移名更觉隆，衣禄无亏天数定，中年晚景一般同",
            "此命推来旺末年，妻荣子贵自怡然，平生原有滔滔福，可有财源如水流",
            "幼年运道未曾享，苦是蹉跎再不兴，兄弟六亲皆无靠，一身事业晚年成",
            "此命推来福不轻，自立自成显门庭，从来富贵人亲近，使婢差奴过一生",
            "为利为名终日劳，中年福禄也多遭，老来是有财星照，不比前番目下高",
            "一世荣华事事通，不须劳碌自亨通，兄弟叔侄皆如意，家业成时福禄宏",
            "一世亨通事事能，不须劳思自然能，宗施欣然心皆好，家业丰亨自称心",
            "此格推来气象真，兴家发达在其中，一生福禄安排定，却是人间一富翁",
            "此命推来厚且清，诗书满腹看功成，丰衣足食自然稳，正是人间有福人",
            "走马扬鞭争名利，少年做事废筹论，一朝福禄源源至，富贵荣华显六亲",
            "此格推来礼仪通，一生福禄用无穷，甜酸苦辣皆尝过，财源滚滚稳且丰",
            "福禄盈盈万事全，一生荣耀显双亲，名扬威震人钦敬，处世逍遥似遇春",
            "平生福禄自然来，名利兼全福禄偕，雁塔提名为贵客，紫袍金带走金鞋",
            "细推此格妙且清，必定才高礼仪通，甲第之中应有分，扬鞭走马显威荣",
            "一朝金榜快提名，显祖荣宗立大功，衣食定然原欲足，田园财帛更丰盈",
            "不做朝中金榜客，定为世上一财翁，聪明天赋经书熟，名显高克自是荣",
            "此名生来福不穷，读书必定显亲荣，紫衣金带为卿相，富贵荣华皆可同",
            "命主为官福禄长，得来富贵定非常，名题金塔传金榜，定中高科天下扬",
            "此格权威不可当，紫袍金带坐高堂，荣华富贵谁能及，积玉堆金满储仓",
            "细推此命福不轻，安国安邦极品人，文绣雕梁政富贵，威声照耀四方闻",
            "此格人间一福人，堆金积玉满堂春，从来富贵由天定，正笏垂绅谒圣君",
            "此名生来福自宏，田园家业最高隆，平生衣禄丰盈足，一世荣华万事通",
            "富贵由天莫苦求，万金家计不须谋，十年不比前番事，祖业根基水上舟",
            "君是人间衣禄星，一生福贵众人钦，纵然福禄由天定，安享荣华过一生",
            "此命推来福不轻，不须愁虑苦劳心，一生天定衣与禄，富贵荣华过一生",
            "此名生来大不同，公侯卿相在其中，一生自有逍遥福，富贵荣华极品隆",
            "此格世界罕有生，十代积善产此人，天上紫微来照命，统治万民乐太平"
       };
        #endregion

        #region Functions

        public static double GetLiang(int year,int day, int month, int time)
        {
            double result = 0;

            // year
            year = year - 1864;

            while (year < 0)
                year += 60;

            while (year > 60)
                year -= 60;

            result += YearWeight[year];

            // month
            result += MonthWeight[month - 1];

            // day
            result += DayWeight[day - 1];

            // time
            result += HourWeight[time];

            return result;
        }

        public static string GetComment(double liang)
        {
            return OriginalResult[Convert.ToInt32((liang - 2.1) * 10)];
        }

        #endregion 
    }
}
